---
kind: method
id: M:Autodesk.Revit.DB.DGNExportOptions.#ctor(Autodesk.Revit.DB.DGNExportOptions)
source: html/b83bcfca-cc71-ea34-d243-6d596f4d8128.htm
---
# Autodesk.Revit.DB.DGNExportOptions.#ctor Method

Constructs a new instance of DGNExportOptions as a copy of the export options.

## Syntax (C#)
```csharp
public DGNExportOptions(
	DGNExportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.DGNExportOptions`) - The options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null